#include <stdio.h>
int main()
{
    int a[4], b[4];
    int n, c, d, e, f, i, j;
    printf("请输入一个四位整数：");
    scanf("%d", &n);
    a[0] = n%10;
    a[1] = ((n - a[0])%100)/10;
    a[2] = ((n - a[0] - a[1])%1000)/100;
    a[3] = (n - a[0] - a[1] - a[2])/1000;

    if(a[0] == a[1] && a[2]== a[3] && a[1] == a[2])
      printf("%d - %d = 0000\n", n, n);
    else
      {
        e = n;
        do
        {
          b[0] = e%10;
          b[1] = ((e - b[0])%100)/10;
          b[2] = ((e - b[0] - b[1])%1000)/100;
          b[3] = (e - b[0] - b[1] - b[2])/1000;

          for(i = 0; i < 3; i++)
             for(j = 0; j < 3 - i; j++)
             if( b[j] > b[j+1])
             {
               f = b[j];
               b[j] = b[j+1];
               b[j+1] = f;
             }

          c = b[0] *1000 + b[1] * 100 +b[2] * 10 +b [3];
          d = b[3] *1000 + b[2] * 100 +b[1] * 10 +b [0];
          e = d - c;
          printf("%d%d%d%d - %d%d%d%d = %d\n", b[3] , b[2] , b[1], b[0], b[0], b[1], b[2], b[3], e);
         }
        while(e != 6174);
       }
    return 0;
}
